; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	spectrograph3 - mode
	infrared5 - mode
	thermograph2 - mode
	image6 - mode
	infrared4 - mode
	spectrograph0 - mode
	thermograph1 - mode
	GroundStation2 - direction
	Star4 - direction
	Star6 - direction
	Star0 - direction
	Star1 - direction
	GroundStation5 - direction
	Star3 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star6)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star3)
	(supports instrument2 spectrograph3)
	(supports instrument2 image6)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 spectrograph3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star0)
	(supports instrument4 image6)
	(calibration_target instrument4 Star6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument5 spectrograph3)
	(supports instrument5 infrared5)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 Star6)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star6)
	(supports instrument7 thermograph2)
	(supports instrument7 image6)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star6)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star1)
	(calibration_target instrument8 Star0)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet12)
	(supports instrument9 image6)
	(calibration_target instrument9 Star3)
	(calibration_target instrument9 GroundStation5)
	(supports instrument10 image6)
	(supports instrument10 infrared5)
	(calibration_target instrument10 Star3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
)
(:goal (and
	(pointing satellite2 Star10)
	(have_image Star7 infrared4)
	(have_image Phenomenon8 thermograph1)
	(have_image Phenomenon8 spectrograph0)
	(have_image Star9 spectrograph3)
	(have_image Star10 infrared4)
	(have_image Phenomenon11 image6)
	(have_image Phenomenon11 thermograph1)
	(have_image Planet12 thermograph2)
	(have_image Planet12 infrared4)
))

)

; plan
1. (turn_to satellite2 star6 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star6)
   goals met: 0 of 10
2. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 10
3. (calibrate satellite2 instrument7 star6)
   added: (calibrated instrument7)
   goals met: 0 of 10
4. (turn_to satellite2 phenomenon8 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon8)
   goals met: 0 of 10
5. (take_image satellite2 phenomenon8 instrument7 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 1 of 10
6. (turn_to satellite2 phenomenon11 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon11)
   goals met: 1 of 10
7. (turn_to satellite1 groundstation2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 10
8. (turn_to satellite0 groundstation5 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 10
9. (take_image satellite2 phenomenon11 instrument7 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 2 of 10
10. (take_image satellite2 phenomenon11 instrument7 image6)
   added: (have_image phenomenon11 image6)
   goals met: 3 of 10
11. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 10
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 10
13. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 3 of 10
14. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 3 of 10
15. (turn_to satellite0 planet12 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet12)
   goals met: 3 of 10
16. (take_image satellite0 planet12 instrument1 infrared4)
   added: (have_image planet12 infrared4)
   goals met: 4 of 10
17. (take_image satellite0 planet12 instrument1 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 5 of 10
18. (turn_to satellite0 star10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star10)
   goals met: 5 of 10
19. (take_image satellite0 star10 instrument1 infrared4)
   added: (have_image star10 infrared4)
   goals met: 6 of 10
20. (turn_to satellite0 star7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star7)
   goals met: 6 of 10
21. (take_image satellite0 star7 instrument1 infrared4)
   added: (have_image star7 infrared4)
   goals met: 7 of 10
22. (turn_to satellite1 phenomenon8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon8)
   goals met: 7 of 10
23. (take_image satellite1 phenomenon8 instrument3 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 8 of 10
24. (turn_to satellite1 star9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star9)
   goals met: 8 of 10
25. (take_image satellite1 star9 instrument3 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 9 of 10
26. (turn_to satellite2 star10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star10)
   goals met: 10 of 10
